import React, { Component } from "react";
import { connect } from "react-redux";

import { Modal, Button } from "react-bootstrap";
import { TermsAndCoditions } from './../accept_terms/TermsAndCoditions'
// STYLES
import './TermsAndCoditionsModal.scss';

// REQUIRE IMAGES

class TermsAndCoditionsModal extends Component {
  arabicBody = () => {
    return (
      <React.Fragment  >
        <div 
         className={'TermsAndCoditionsBody' + (this.props.language === 'ar' ? ' ar-font text-right' : 'text-left')}
       >
          <p className='TermsAndCoditionsBody__p'>
            باستخدام موقع وتطبيق بيوتي فأنت توافق على الالتزام بهذه الشروط والأحكام، وفي حال عدم موافقتك على الشروط والأحكام يتعين عليك عدم استخدام الموقع والتطبيق
          </p>
          <p className='TermsAndCoditionsBody__p'>
            بقبولك لاستخدام بيوتي يجب عليك الالتزام كلياً بجميع الشروط والأحكام لاستخدام الموقع الإلكتروني لبيوتي وجميع الخدمات المرتبطة به من تطبيقات للجوال وغيرها من منصات إلكترونية. والشروط هي كالتالي
          </p>
          <p className='TermsAndCoditionsBody__p_bold'>
            : فتح حساب في بيوتي
          </p>
          <p className='TermsAndCoditionsBody__p_bold'>
            إذا وافقت على فتح حساب، فانه يجب عليك الاتي
          </p>
          <ul className='TermsAndCoditionsBody__p'>
            <li>استخدامه شخصياً ويحق لك تسجيل حساب شخصي واحد فقط. وبذلك لن تمثل أشخاص أخرين أو تتقمص شخصياتهم</li>
            <li>أن تقوم بحجز أو شراء الخدمات المقدمة بجدية وذلك وفقاً لهذه الشروط</li>
            <li>أن تقوم بحجز أو شراء خدمات لاستخدامها أو إهداءها فقط</li>
            <li>أن تكون على معرفة وعلم تام بان حسابك الشخصي مسؤولية استخدامه تقع عليك فقط وبذلك يجب عليك الحفاظ على معلوماتك السرية كالرقم السري وما شابهه. وان بيوتي لن تكون مسؤولة أطلاقاً عن أي سوء استخدام قد ينتج عن إهمال أو سوء حفظ لمعلومات حسابك من طرفك</li>
            <li>أن تكون مسؤوليتك تامة على كل ما يتم نشره في حسابك على موقع بيوتي الإلكتروني وتطبيقات الجوال واي خدمات تقدمها بيوتي</li>
            <li>لا يمكنك تفويض استخدام حسابك في الخدمة أو بيعة أو نقل ملكيته أطلاقاً. واي مخالفة من قبلك لأي من هذه الشروط فإنها تخولنا بالإطلاق أن نقوم بحذف الحساب وستفقد إي مزايا أو أرصدة متبقية فيه أو له. وذا قمنا بحذف حسابك فانه لا يحق لك تسجيل حساب آخر حتى نقوم بدعوتك للتسجيل. سنقوم بحذف حسابك للأبد ولنا الحق كلياً باتخاذ جميع الإجراءات اللازمة قانونياً لملاحقة وتتبع أي إجراءات تنتج عن استخدامك لحسابك في بيوتي باي طرق غير مشروعة</li>
          </ul>

          <p className='TermsAndCoditionsBody__p_bold'>
            إستخدامك للخدمة
          </p>
          <ul className='TermsAndCoditionsBody__p'>
            <li>يمكنك استخدام جميع ما يحتويه موقع بيوتي من محتوى سواء مرئي أو مكتوب بشكل شخصي وليس لأي غرض تجاري، لا يحق لك نشر أو إضافة أي محتوى:يتخطى حقوق الأخرين من علامات تجارية أو براءات اختراع أو أي ما يخص أطراف أخرى.
              </li>
            <li>يعد خطراً أو استغلالياً أو تخريبياً لأي شخص أو طرف أخر. يحوي محتوى أعلاني أو استغلال معلومات مستخدمين أخرين للخدمة والإعلان لهم بما يسمى (الإرسال الجماعي) والإزعاج (سبام)</li>
            <li>شخصنة موظفي أو ممثلي بيوتي أو إيهام الأخرين بانتمائك لبيوتي باي طريقة كانت</li>
            <li>إقرارك التام بانه لن ينتج عن استخدامك أي محاولات اختراق أو إغراق لخوادم الخدمات التي نقدمها في بيوتي مما يمنع وصول الخدمة لمستفاديها</li>
            <li>إقرارك التام أن لن تكون جزء أو أساساً لتنظيم محاولات اختراق أو استغلال مصادر بيوتي التقنية عن طريق الهندسة العكسية أو إعادة استخدام الخوارزميات والأفكار البرمجية المضمنة في الخدمة. وانه لا يحق لك استغلال أي من هذه المصادر في أعاده بيع أو استخدام باي طريقة كانت بدون أذن مكتوب ومسبق من قبل بيوتي. جميع معلوماتك التي يتم أضافتها ضمن عملية تسجيلك في بيوتي تخضع لسياسة الخصوصية في بيوتي</li>
          </ul>

          <p className='TermsAndCoditionsBody__p_bold'>
            شروط البيع
          </p>
          <ul className='TermsAndCoditionsBody__p'>
            <li>الخدمة توفر سوقاً إلكترونياً تملكه بيوتي، وهو مكون من عدة خدمات وعروض ترويجية وتسويقية بالنيابة عن مقدمي خدمة معينين وذلك بتوفير المواعيد وقسائم العروض لها بعدة طرق</li>
            <li>يقوم مستخدمو الخدمة بشراء المواعيد أو قسائم العروض لخدمات مقدمي الخدمة وذلك مقابل حصولهم على خدمات أو منتجات معروضة في بيوتي وهي كليةً تندرج تحت ما تنص عليه الشروط في هذا المستند</li>
            <li>المواعيد التي تقوم بحجزها عبر خدمة بيوتي تعد عروض مقدمة من مقدمي الخدمة وتم عرضها على بيوتي</li>
            <li>هذه المواعيد يمكن مقابلها الحصول على خدمه أو منتج معين وفقاً لمحتواها وتفاصيلها من مقدم الخدمة المحدد</li>
            <li>يعد مقدم الخدمة وحده المسؤول عن تقديمها وجميع ما يتبع ذلك من أضرار مالية أو نفسية أو صحية بأي شكل كانت من الخدمة المقدمة سواء ارتبط ذلك كنتيجة للموعد المحجوز عن طريق بيوتي أم لا</li>
            <li>باستخدامك للخدمة الإقرار الكامل بان بيوتي وملاكها ومدراءها وموظفيها وممثليها لا تشملهم أي مسؤولية عما قد ينتج عن إلغاء موعد أو حجز لخدمه معينه من قبل مزود الخدمة التي تم حجزها عن طريق خدمات بيوتي الإلكترونية</li>
            <li>بحجزك لموعد أو محاولتك للحجز باي طريقة كانت عبر خدمات بيوتي فان ذلك يعد إقرارك التام بشروط وأحكام استخدام الخدمة</li>
            <li>بملكية الموقع وخدمات بيوتي الإلكترونية يحق لبيوتي الغاء أو حذف أي عضوية أو أسماء مستخدمة للتسجيل بالخدمة</li>
            <li>أي محتوى يتم أضافته للموقع وتطبيقات بيوتي الإلكترونية يعد ملكيةً لبيوتي وفقاً لسياسة الخصوصية</li>
            <li>لبيوتي الحق في استخدام أي محتوى متوفر عل الموقع والتطبيقات الإلكترونية</li>
            <li>تستحق بيوتي نسبة وقدرها (25 %) من مقدم الخدمة وذلك كحد أدني</li>
          </ul>


          <p className='TermsAndCoditionsBody__p_bold'>
            شروط وأحكام عامة
          </p>
          <ul className='TermsAndCoditionsBody__p'>
            <li>يجب ألا يقل عمرك عن 18 عاما</li>
            <li>يحتاج أي شخص أقل من 18 عاما يقوم باستخدام موقع وتطبيق بيوتي إلى الحصول على موافقة والديه أو وصيه للقيام بذلك</li>
            <li>أن تكون ذا أهلية قانونية كاملة للتعاقد والتعامل</li>
            <li>تقر وتتعهد بأنك تتمتع بالحق والقدرة القانونية على استخدام موقع وتطبيق بيوتي حسب ما هو منصوص عليه في هذه الشروط والأحكام</li>
            <li>:تقر بأن أي استخدام تقوم به لموقع وتطبيق بيوتي سيكون حسب ما هو منصوص عليه في الشروط التاليه
              <ul>
                <li>لن تقوم بنسخ، تحميل، إعادة إنتاج، إعادة نشر، تأطير، بث، أو إرسال بأي شكل من الأشكال أي من المواد التي يوفرها موقع وتطبيق بيوتي</li>
                <li>تلتزم بالقواعد المحددة التي تنطبق على أي ترويج تشارك فيه بأي شكل من خلال موقع وتطبيق بيوتي</li>
                <li>تلتزم بعدم القيام بأي شيء يكون من شأنه التأثير على تشغيل أو أمن موقع وتطبيق بيوتي أو يتسبب في انزعاج غير منطقي أو إساءة أو تعطيل أي من المستخدمين الآخرين أو العاملين لدينا</li>
                <li>يجب ان لا تكون منافسا لـ بيوتي أو تقدم أي منتج مشابه لما تقدمه بيوتي</li>
                <li>يتمثل المستخدم ومزود الخدمة لكافة القوانين واللوائح المعمول بها داخل الدولة التي تم تقديم الخدمة فيها</li>
                <li>يجب ان تقدم معلومات صحيحه ودقيقه لـ بيوتي كما يجب عليك الالتزام لأي إشعارات تقوم بها بيوتي فيما يخص الخدمات التي تقدمها بيوتي لضمان عدم تعرقل أي عمليات تشغيليه تقوم بها بيوتي</li>
                <li>يجب ان لا يكون استخدامك لخدمات بيوتي مسببا لأي إيذاء أو مضايقه أو إزعاج لأي شخص كان</li>
                <li>المحافظة على كامل المحتويات والأرقام السرية للدخول لحسابك بشكل أمان</li>
                <li>يحق لـ بيوتي رفض تقديم أي خدمه أو استخدام للتطبيق دون ان تبدي لك الأسباب</li>
                <li>من أجل الوصول إلى موقع وتطبيق بيوتي، ستحتاج إلى الوصول إلى الإنترنت. تتحمل مسؤولية أي اتصال، أو خدمة أو رسوم مرتبطة بالوصول إلى الإنترنت وتوفير كافة المعدات اللازمة لتمكينك من الاتصال بالإنترنت (بما في ذلك الحاسوب والمودم وغيرها من الأجهزة الضرورية للوصول) نظرا لمحدودية قدرة كافة أجهزة الخادم (سيرفر) واستخدامها من قبل العديد من الأشخاص في الوقت نفسه، فإنك تلتزم بعدم استخدام موقع وتطبيق بيوتي بأي شكل من الأشكال التي تؤدي إلى تخريب أو تتجاوز قدرة تحمل أجهزة الخادم (سيرفر) لدينا أو أي شبكة مرتبطة بأي من خوادمنا. كما يجب أن تمتنع عن استخدام موقع وتطبيق بيوتي بأي شكل من الأشكال يؤدي، أو قد يؤدي منطقيا، بالتدخل في استخدام أي طرف آخر لموقع وتطبيق بيوتي على نحو يخالف، أو من المحتمل أن يخالف، أي قوانين مرعية ومطبقة، أو حقوق أو استحقاقات قانونية لأي طرف آخر وذلك طبقا لكافة القوانين المطبقة</li>
                <li>تتكفل بيوتي بسرية المعلومات وسوف تعمل جاهدة بالحد من اَي عملية انتهاك</li>
                <li>لبيوتي الحق في الاطلاع على جميع بيانات المستخدمين المدونة من قبلهم وإذا ظهر لبيوتي ان المعلومات غير صحيحة أو البيانات البنكية غير صحيحة فلها الرجوع على من قام بذلك بضعف المبلغ المدفوع</li>
                <li>يوتي الحق في إيقاف اَي مستفيد من الخدمة إذا كان هناك امر يستلزم ذلك كأمر قضائي أو طلب من السلطات وما إلى ذلك</li>
                <li>يحق للمستفيد إرسال تقرير بشأن تعدي الطرف الاخر ولبيوتي الحق في تطبيق الإجراء القانوني المتبع في بيوتي أو حسب الأنظمة في المملكة العربية السعودية وإيقاف المستفيد من الخدمة</li>
                <li>يجب تحديث بينات المستفيد في حال تغير المكان او الزمان</li>
                <li>جميع الآراء والأعمال تعبر عن وجهة نظر كاتبها او عاملها وبيوتي تخلي مسؤوليتها القانونية تجاه هذه الآراء والتجارب</li>
                <li>يمنع التوصية بأدوية طبية او مستحضرات او تركيبات ليست مرخصة من هيئة الغذاء والدواء ووزارة الصحة من جميع المستفيدين وبيوتي تخلي مسؤوليتها عن كل من يوصي بأي أدوية أو أعشاب او تركيبات او اَي مصنف من هذا القبيل لصالح اَي مستفيد اخر (بكل انواع المستفيدين)</li>
                <li>عند اكتشاف المستفيد لخلل تقني عليه اخطار القائمين على تطبيق بيوتي بشكل مباشر وفى أقرب وقت ممكن وذلك لتدارك الخلل والاحتفاظ بسرية الخلل وفِي حال استغلال الخلل فيما يضر التطبيق او سمعته او بأي شكل من الأشكال فيحق لبيوتي مقاضاته حسب الأنظمة المتبعة في المملكة العربية السعودية او اَي دولة من دول الخليج</li>
                <li>يجب المحافظة على الآداب العامة في الزيارة والمواعيد وأي إخلال بذلك فللقائمين على تطبيق بيوتي الحق في إيقاف المستخدم وتخلي مسؤوليتها عن أي تصرفات مخلة بالآداب العامة والعادات والتقاليد بالمملكة العربية السعودية</li>
                <li>يجب عَلى المستخدم استخدام التطبيق وفق ما قُدم له وفِي حال انتهاك اَي شرط او استخدام للتطبيق بغير الغرض الذي وضع له او محاولة اختراق التطبيق فإن للقائمين على تطبيق بيوتي الحق في التتبع وعمل الإجراء القانوني والتقني المناسب وفق السياسات المتبعة في بيوتي والانظمة في المملكة العربية السعودية ودول الخليج العربي ودول الشرق الاوسط</li>
                <li>في حال تم انتهاك الشروط والاحكام بشكل جزئي او كلي فإن لبيوتي الحق بعمل الإجراء المناسب وفقا للأنظمة المعمول بها بالمملكة العربية السعودية ودول الخليج العربي ودول الشرق الاوسط</li>
              </ul>
            </li>

          </ul>


          <p className='TermsAndCoditionsBody__p_bold'>
            توافق على الامتناع عن الأمور التالية (سواء قمت أنت بها شخصيا أو من خلال طرف ثالث)
          </p>
          <ul className='TermsAndCoditionsBody__p'>
            <li>استخدام عملية آلية لمعالجة، مراقبة، نسخ، استخراج أي صفحات موجودة على موقع وتطبيق بيوتي، أو أي معلومات، أو محتوى أو بيانات يحتويها أو يتم الوصول إليها عن طريق موقع وتطبيق بيوتي، دون الحصول على موافقة خطية مسبقة من قبلنا</li>
            <li>استخدام عملية آلية لتجميع أو دمج المعلومات، أو المحتوى أو البيانات التي يحتويها أو يمكن الوصول إليها عن طريق موقع وتطبيق بيوتي مع المعلومات، أو المواد أو البيانات التي يتم الوصول إليها عن طريق، أو التي يكون مصدرها، طرف ثالث</li>
            <li>استخدام أي عملية آلية للتدخل في أو محاولة التدخل في طريقة العمل السليمة لموقع وتطبيق بيوتي</li>
            <li>القيام بأي فعل يكون من شأنه فرض حمل كبير بشكل غير منطقي أو غير متناسب مع البنية التحتية المتاحة أو النطاق الترددي لموقع وتطبيق بيوتي</li>
            <li>تطبيق هندسة عكسية، أو جمع عكسي، أو تفكيك، أو أي عمل آخر من شأنه اكتشاف رمز مصدري أو غيره من الصيغ الحسابية أو المعالجات فيما يخص برنامج الحاسوب المستخدم في البنية التحتية والعمليات المتعلقة بموقع وتطبيق بيوتي</li>
            <li>نسخ، إعادة إنتاج، تغيير، تعديل، اشتقاق أعمال من، أو إقامة عرض عام، لأي جزء من محتوى موقع وتطبيق بيوتي دون الموافقة الخطية المسبقة من قبلنا</li>
          </ul>

          <p className='TermsAndCoditionsBody__p_bold'>
            باستخدامك موقع وتطبيق بيوتي فأنت توافق على عدم نشر، أو رفع، أو إرسال، أو توزيع، أو تخزين، أو إيجاد أو نشر بأي شكل من الأشكال، أو التسبب في نشر على موقع وتطبيق بيوتي بشكل مباشر أو غير مباشر عن طريق موقع وتطبيق إلكتروني للغير أي من الأمور التالية
          </p>
          <ul className='TermsAndCoditionsBody__p'>
            <li>محتوى غير قانوني، تشهير، ذم، مسيء لأي مجموعة دينية أو أخلاقية، محتوى فاضح، إباحي، فاحش، بذيء، فيه إيحاءات، مضايقات، تهديدات، خرق لحقوق الخصوصية والنشر، عنيف، مثير للحساسيات، احتيالي، أو غير مقبول بأي شكل من الأشكال</li>
            <li>محتوى يشكل، يشجع، يقدم تعليمات لمخالفة جرمية، خرق حقوق أي طرف كان، أو يتسبب بأي شكل من الأشكال في مسؤولية قانونية أو يخرق أي من القوانين المحلية أو الوطنية أو الدولية، بما في ذلك، على سبيل الذكر وليس الحصر، التشريعات المتعلقة بمنظم سوق الأوراق المالية في ذلك الاختصاص الذي تم نشر المحتوى فيه</li>
            <li>محتوى يتسبب في إزعاج أو مضايقة الآخرين</li>
            <li>محتوى لا تمتلكه أنت شخصيا دون إذن صريح من مالك ذلك المحتوى</li>
            <li>محتوى قد يتسبب في خرق أي براءة اختراع، علامة تجارية، سر تجاري، حقوق التأليف والنشر، أو غيرها من الحقوق الفكرية أو الملكية لأي طرف</li>
            <li>محتوى ينتحل شخصية أي شخص حقيقي أو اعتباري أو يتسبب بأي شكل من الأشكال في ادعاء كاذب بتبعية لذلك الشخص الحقيقي أو الاعتباري، بما في ذلك نحن</li>
            <li>مواد ترويجية غير مرغوبة، حملات سياسية، الإعلانات، المسابقات، السحوبات، أو تقديم عروض</li>
            <li>معلومات خاصة بطرف ثالث، وعلى سبيل المثال لا الحصر، اسم العائلة، عنوان، أرقام هواتف، عناوين بريد إلكتروني، وأرقام بطاقات ائتمان</li>
            <li>فيروسات، بيانات مخربة، ملفات أخرى تتسبب في أضرار، أو أعطال أو تخريب</li>
            <li>لا تتحمل بيوتي مسؤولية أو نقر أي محتوى ينشره المستخدمون، يرفعونه في، يبثونه، يوزعونه، يخزنونه، يوجدونه، ينشرونه بأي شكل من الأشكال، أو يتسببون في نشره على موقع وتطبيق بيوتي مباشرة أو من خلال موقع وتطبيق إلكتروني للغير</li>
            <li>لا تتحمل بيوتي أي مسؤولية عن أي محتوى يتم نشره أو تخزينه أو رفعه في المناطق التفاعلية من قبلك أو من قبل أي طرف ثالث، أو عن أي خسارة أو أضرار ناجمة عن ذلك</li>
            <li>لا تتحمل بيوتي مسؤولية أية أخطاء، ذم، تحقير، تشهير، سهو، أكاذيب، إساءة، إباحية، أو شتائم قد تصادفك أثناء استخدامك للمناطق التفاعلية</li>
            <li>لا تتحمل بيوتي أية مسؤولية عن أي عبارات، تعهدات أو محتوى يقدمه المستخدمون في أي منتدى عام، صفحة رئيسية شخصية، أو غيرها من المناطق التفاعلية. ورغم أننا غير ملزمون بمسؤولية فرز أو تحرير أو متابعة أي من المحتوى الذين يتم نشره أو توزيعه من خلال المنطقة التفاعلية، فإننا، وطبقا لتقديرنا المطلق، من الممكن أن نزيل، نفرز، نرفض نشر، أو تحرير دون تنبيه مسبق، أي محتوى تم نشره أو تخزينه عن طريق موقع وتطبيق بيوتي في أي وقت ونتيجة لأي سبب. وتكون أنت وحدك فقط مسؤولا عن إنشاء نسخ احتياطية أو استبدال المحتوى الذي نشرته أو حفظته على موقع وتطبيق بيوتي وعلى نفقتك الخاصة</li>
            <li>لا تتحمل بيوتي أي مسئولية عن أي اضرار مهما كانت أو مشاكل تحدث للعميل من مزود الخدمة أو أحد العاملين لديه سواء كان ذلك بطريقة مباشرة أو غير مباشرة</li>
            <li>إذا كانت لديك أية شكاوى ناشئة عن المحتوى الذي قام مستخدم بنشره أو رفعه، أو بثه، أو توزيعه، أو حفظه، أو إيجاده، أو تسبب بأي شكل من الأشكال بنشره على موقع وتطبيق بيوتي مباشرة أو عن طريق موقع وتطبيق إلكتروني للغير، فأنت توافق على مباشرة الشكوى ضد ذلك المستخدم وليس ضدنا نحن</li>
          </ul>



          <p className='TermsAndCoditionsBody__p_bold'>
            الملكية الفكرية
          </p>
          <ul className='TermsAndCoditionsBody__p'>
            <li>إن حقوق النشر وكافة حقوق الملكية الفكرية الأخرى في كافة المواد والمحتوى الذي يتم توفيره كجزء من الموقع والتطبيق هي ملك بيوتي</li>
            <li>لا يجوز لك استخدام هذه المادة أو المحتوى الا بموافقة وتصريح خطّيا من قبلنا</li>
            <li>لن تعمل على، ولن تقوم بمساعدة أو تسهيل عمل الغير على، نسخ المادة أو المحتوى، أو إعادة إنتاجه، بثه، توزيعه، تكييفه، استخدامه على نحو تجاري، أو إيجاد أعمال مبنية عليها</li>
            <li>إذا علمت بوجود توزيع أو استغلال تجاري من أي نوع، فأنت توافق على إعلامنا بذلك مباشرة</li>
          </ul>

          <p className='TermsAndCoditionsBody__p_bold'>
            المسؤولية عن المعلومات التي يقدمها موقع وتطبيق بيوتي
          </p>
          <ul className='TermsAndCoditionsBody__p'>
            <li>مع التقيد بالمسؤوليات التي يقررها القانون والتي لا يمكن استثناؤها، فإننا وكل من مديرينا، أو موظفينا، أو وكلائنا، أو المتعاقدين فى بيوتي، لا نتحمل أي مسؤولية تجاهك نتيجة أي خسائر، أضرار، مسؤوليات، مطالبات، أو تكاليف (بما في ذلك دون تقييد ودون حصر التكاليف القانونية ورسوم الدفاع أو تكاليف التسوية) بأي شكل من الأشكال أو وجه من الوجوه، سواء على نحو مباشر، أو غير مباشر، أو كنتيجة ناشئة عن أو راجعة إلى الوصول إلى موقع وتطبيق بيوتي من قبلك، أو محتوى، أو موقع وتطبيق إلكتروني للغير، أو خدمات الغير، بأي شكل نتجت، سواء في عقد، أو ضرر (بما في ذلك الإهمال)، أو قانون، أو غير ذلك</li>
            <li>نلتزم بالسعي الحثيث من أجل إحاطة موقع وتطبيق بيوتي بكافة أشكال العناية المنطقية، باستثناء ما يلزم به القانون، فإننا لن نتحمل مسؤولية النوعية والدقة، وملاءمة غرض محدد في موقع وتطبيق بيوتي ولا نقدم وعدا بأن المادة التي يحتويها موقع وتطبيق بيوتي، أو أي من الخدمات التي يحتويها موقع وتطبيق بيوتي أو أي من أجهزة الخادم لديه سوف يعمل دون انقطاع أو تأخير أو يكون دون أخطاء، وخاليا من الفيروسات أو الأخطاء البرمجية أو يعمل بتوافق مع أي برنامج آخر أو مادة أخرى</li>
            <li>لا نتحمل مسؤولية تجاهك نتيجة أي خسائر أو أضرار قد تعاني منها أنت أو الغير نتيجة استخدام أو فيما يتصل بقيامك باستخدام موقع وتطبيق بيوتي</li>
            <li>لا نتحمل مسؤولية تجاهك أو أي شخص آخر نتيجة أي خسارة ناجمة عن أمر لا سيطرة لنا عليه. وهذا يتضمن تعطل المعدات الإلكترونية أو الميكانيكية أو خطوط الاتصالات (بما في ذلك الهاتف، والكابل، والإنترنت)، أو الوصول غير المشروع، أو الرموز المخربة، أو السرقة، أو أخطاء التشغيل، أو الأحوال الجوية القاسية أو غير الاعتيادية (بما في ذلك الفيضانات، والزلازل، أو غيرها من أعمال القدر)، أو النار، أو الحرب، أو التمرد، أو الأعمال الإرهابية، أو الشغب، أو الخلافات العمالية، أو المشكلات العمالية الأخرى، أو الحوادث، أو الطوارئ، أو التأخير، أو الحجوزات الزائدة، أو الإلغاء، أو وفاة حاكم، أو عمل تقوم به الحكومة</li>
          </ul>

          <p className='TermsAndCoditionsBody__p_bold'>
            الإنهاء
          </p>
          <ul className='TermsAndCoditionsBody__p'>
            <li>نحتفظ بحقنا في الإنهاء الفوري لاستخدامك لموقع وتطبيق بيوتي في حال قيامك بخرق بنود هذه الشروط والأحكام أو في حال اعتقدنا بناء على أسباب منطقية أنك من الممكن أن تقوم بخرق بنود هذه الشروط والأحكام أو في حال قيامك بسلوك نرى أنه وبناء على تقديرنا المطلق غير مقبول</li>
          </ul>


          <p className='TermsAndCoditionsBody__p_bold'>
            المسؤولية القانونية
          </p>
          <ul className='TermsAndCoditionsBody__p'>
            <li>لا تتحمل بيوتي أي مسؤولية أضرار نتجت عن استخدام أو عدم القدرة على استخدام وسائل اتصال إلكترونية مع الموقع الإلكتروني أو مع التطبيق</li>
            <li>مقدم ومزود الخدمة تقع عليه مسؤولية جودة خدمة المساعدة على الطريق المطلوبة من بيوتي باستخدام التطبيق أو الخدمة بأكملها</li>
            <li>بيوتي لا تتحمل في أي ظرف كان مسؤولية أي خطأ نتج عن مقدم الخدمة</li>
            <li>أي ملاحظه على مزود الخدمة يجب تقديمها في تقييم خدمته لاتخاذ الأجراء اللازم بحقه من قبلنا كما ان بيوتي لا تتحمل أي سلوك أو إهمال أو جميع ما سبق من مزود الخدمة</li>
            <li>بيوتي لا يوجد لديها أي ضمانات تخص الخدمات المقدمة</li>
            <li>القانون المعمول به وحل النزاعات سيكون حسب النظام المتبع في الدولة التي تم تقديم الخدمة فيها</li>
          </ul>


          <p className='TermsAndCoditionsBody__p_bold'>
            نحن نهتم جداً بخصوصيتك ونحترم ذلك كثيراً ولكن لتقديم خدمة مميزة لك وجب مشاركة هذه المعلومات
          </p>
          <ul className='TermsAndCoditionsBody__p'>
            <li>هذه البيانات قد نستخدمها لتحسين تجربتك مع بيوتي بما في ذلك التواصل معك احياناً واطلاعك على أخر الاخبار والعروض، ويمكنك التحكم بذلك كله من خلال ملفك الشخصي، نستخدم الأدوات الخاصة بالبرنامج وبنا لتقديم خدمة مخصصة أفضل لك حين استخدامك واستفادتك من خدماتنا</li>
            <li>قد يتم استخدام معلومات الزيارات وجميع البيانات للزائر للموقع وخدماتنا عن طريق برامج تحليل وتنسيق البيانات مثل خدمة قوقل لتحليل بيانات الزوار للموقع ولكن بدون عرض اي معلومات شخصية وهذا جزء دارج في الخدمات المُقدمة على الانترنت عموماً</li>
          </ul>


          <p className='TermsAndCoditionsBody__p_bold'>
            باستخدامك تطبيق بيوتي فأنت توافق على الشروط والأحكام
          </p>
          <ul className='TermsAndCoditionsBody__p'>
            <li>يحق للمستخدم الاستفادة من التطبيق بكل اقسامه بشرط ان يقم بنفسه بذلك ولا يمثل اشخاص اخرين في استعماله للتطبيق</li>
            <li>مسؤولية الحساب الشخصي تقع عليك فقط والمستفيد هو من عليه ان يؤكد صحة البيانات من عدمها وبيوتي يخلي مسؤوليته من جميع المعلومات الخاطئة المسجلة بالتطبيق</li>
            <li>لا يحق استعمال او نشر او اختراق او إضافة أي جزئية من التطبيق لأي غرض تجاري بدون اذن القائمين على التطبيق</li>
            <li>لا يحق للمستفيد بيع حسابه او نقل ملكيته او تفويض أحد للقيام على الحساب بدون اذن القائمين على التطبيق، ويحق لبيوتي عند اكتشاف الامر إيقاف المستفيد من الحساب فورا دون الرجو للمستفيد او المستخدم وستفقد أي مزايا او ارصدة لك متبقية فيه او له وتكون من حق بيوتي فقط كما انه لا يمكنك التسجيل الا بعد موافقة بيوتي او تقوم بيوتي بدعوتك للتسجيل</li>
            <li>عند استعمال تطبيق بيوتي لا يحق للمستفيد استعمال أي تطبيق اخر منافس له طوال مدة اشتراكه وحتى بعد انتهاء اشتراكه لمدة سنتين على الأقل</li>
          </ul>


          <p className='TermsAndCoditionsBody__p_bold'>
            المعلومات التي نفصح عنها
          </p>
          <p className='TermsAndCoditionsBody__p_bold'>
            لا نفصح عن المعلومات الشخصية إلا في إحدى الحالات التالية
          </p>
          <p className='TermsAndCoditionsBody__p_bold'>
            موافقة منك
          </p>
          <ul className='TermsAndCoditionsBody__p'>
            <li>سيتم الإفصاح عن معلوماتك إذا كنت توافق على ذلك؛ ونحتاج إلى موافقتك على الإفصاح عن أية معلومات شخصية حساسة</li>
          </ul>
          <p className='TermsAndCoditionsBody__p_bold'>
            مع مشرفي النطاق
          </p>
          <ul className='TermsAndCoditionsBody__p'>
            <li>إذا كانت تتم إدارة حسابك في بيوتي بواسطة مشرف نطاق فستكون لدى مشرف النطاق والموردين الذين يقدمون دعم المستخدم إمكانية الدخول إلى معلومات حسابك (بما في ذلك بريدك الإلكتروني والبيانات الأخرى)؛ قد يتمكن مشرف النطاق مما يلي</li>
            <li>عرض الإحصاءات المتعلقة بحسابك، تغيير كلمة مرور حسابك تعليق إمكانية الدخول إلى حسابك أو إنهائها، الدخول إلى المعلومات المخزنة كجزء من حسابك أو الاحتفاظ بها، تلقي معلومات حسابك التزاماً بما يسري من قانون أو لائحة أو إجراء قانوني أو طلب حكومي واجب النفاذ. تقييد إمكانية حذف أو تعديل المعلومات أو إعدادات الخصوصية</li>
          </ul>


          <p className='TermsAndCoditionsBody__p_bold'>
          للمعالجة الخارجية
          </p>
          <ul className='TermsAndCoditionsBody__p'>
            <li>نقدم المعلومات الشخصية إلى الشركات التابعة لنا أو غيرها من المؤسسات أو الأشخاص الموثوق بهم ليعالجوها لنا بناءً على إرشاداتنا وبما يتفق مع سياسة الخصوصية وأي إجراءات مناسبة أخرى متعلقة بالسرية والأمان</li>
          </ul>


          <p className='TermsAndCoditionsBody__p_bold'>
          لأسباب قانونية
          </p>
          <ul className='TermsAndCoditionsBody__p'>
          <li>سيتم مشاركة المعلومات الشخصية مع الشركات أو المؤسسات أو الأفراد خارج بيوتي إذا كنا نعتقد بنية حسنة أنه من الضروري الدخول إلى المعلومات أو استخدامها أو الاحتفاظ بها أو نشرها لأي من الأسباب التالية</li>
         <li>الالتزام بأي قانون ساري أو لائحة سارية، أو إجراء قانوني أو طلب حكومي واجب النفاذ، تطبيق بنود الخدمة السارية، بما في ذلك البحث في احتمال صدور انتهاكات، اكتشاف احتيال أو مشكلات فنية أو مشكلات أمان أو الحيلولة دون وقوعها أو غير ذلك من إجراءات التعامل معها، الحماية من إلحاق ضرر بحقوق أو ملكيات أو سلامة بيوتي أو مستخدميها أو طبقًا لما يقتضيه أو يسمح به القانون، يجوز لنا مشاركة معلومات لا تحدد الهوية الشخصية مع الجميع ومع شركائنا – كالمعلنين أو مواقع الويب المتصلة</li>
          </ul>
          

          <p className='TermsAndCoditionsBody__p_bold'>
          جميع حقوق التطبيق وبياناته وتشمل على سبيل المثال لا الحصر (حقوق الملكية الفكرية والعلامة التجارية والتصاميم وبيانات المستخدمين) من حق الشركة المالكة لتطبيق بيوتي والمقررة في اَي نظام قانوني أو بموجب اتفاقية دولية بشأن أي عمل فكري بما في ذلك اعمال البرمجيات والمحتوى الكتابي بجميع اللغات وما إلى ذلك
        </p>
        <p className='TermsAndCoditionsBody__p_bold'>
        نحتفظ بحقنا بتغيير الشروط والأحكام من وقت لآخر وعليه يتعين عليك الاطلاع على هذه الشروط والأحكام بشكلٍ دوري، ولا يتوجب علينا الاتصال بك أو إعلامك بأي تغييرات تم إجراؤها على الشروط والأحكام، ويعتبر استمرار استخدامك لموقع وتطبيق بيوتي بمثابة موافقة على الشروط والأحكام المطبقة في وقت استخدامك للموقع والتطبيق كجزء من التزامنا بجعل موقع وتطبيق بيوتي مكانا ترغب في زيارته باستمرار فإننا نرحب بكافة تعليقاتك على أي من السياسات أو القواعد التي ندرجها أدناه
        </p>
        </div>

      </React.Fragment>
    )
  }


  render() {
    if (this.props.localization) {
      return (
        this.arabicBody()
      );
    } else return null;
  }
}

const mapStateToProps = state => {
  return state;
};

export default connect(mapStateToProps, {})(TermsAndCoditionsModal);
export { TermsAndCoditionsModal };


